import "./training.scss";

import TrainingBlock from "./training-block/training-block";

function Training() {
  return (
    <>
      <TrainingBlock>
        <div className="training-block__wrapper">
          <h2>Зачем нужно печатать вслепую?</h2>
          <p>
            Тренировка слепой печати помогает совершенствовать скорость и
            качество набора текста. Это заключается в упражнениях, которые
            заставляют пользователя набирать текст без просмотра клавиатуры.
            Тренировка слепой печати помогает улучшить память, скорость и
            координацию рук.
          </p>
        </div>
      </TrainingBlock>
      <TrainingBlock>
        <div className="training-block__wrapper">
          <div className="training-block__content-block">
            <div>
              <h2>Поза при печати текста</h2>
              <p>
                Для того, чтобы печатать было удобнее всего, нужно выполнять
                следующие условия:
              </p>
              <p>
                <ul className="training-block__list">
                  <li>
                    Сидеть прямо, руки расположить на 20-25 см от тела, локти
                    должны быть расслаблены, плечи согнуты.
                  </li>
                  <li>
                    Клавиатура установлена так, чтобы пальцы держали прямую
                    позу.
                  </li>
                  <li>
                    Экран монитора установлен так, чтобы глаза смотрели на него
                    под углом примерно 45-60°, но не меньше 20°.
                  </li>
                  <li>Расстояние от глаз до экрана должно быть 45-75 см.</li>
                </ul>
              </p>
            </div>
            <img
              src={require("../../assets/img/training-img1.png")}
              alt="Computer"
            />
          </div>
        </div>
      </TrainingBlock>
      <TrainingBlock>
        <div className="training-block__wrapper">
          <div className="training-block__content-block">
            <div>
              <h2>Исходная позиция</h2>
              <p>
                Немного согни пальцы и положи их на клавиши ФЫВА и ОЛДЖ, которые
                находятся в среднем ряду. Эта строка называется ОСНОВНОЙ
                СТРОКОЙ, потому что ты всегда будешь начинать с этих клавиш и
                возвращаться к ним.
              </p>
              <p>
                На клавишах А и О, под указательными пальцами, находятся
                небольшие выступы. Они позволяют ориентироваться на клавиатуре
                вслепую.
              </p>
            </div>
          </div>
          <img src={require("../../assets/img/training-img2.png")} alt="Keys" />
        </div>
      </TrainingBlock>
      <TrainingBlock>
        <div className="training-block__wrapper">
          <div className="training-block__content-block">
            <div>
              <h2>Схема клавиатуры</h2>
              <p>
                Цвет клавиш на этой клавиатуре поможет тебе понять и запомнить,
                каким пальцем на какую клавишу нужно нажимать.
              </p>
              <p>
                <ul className="training-block__list">
                  <li>
                    Нажимай клавиши только тем пальцем, который для них
                    предназначен.
                  </li>
                  <li>
                    Всегда возвращай пальцы в исходную позицию «ФЫВА – ОЛДЖ».
                  </li>
                  <li>
                    Когда набираешь текст, представляй расположение клавиш.
                  </li>
                  <li>
                    Установи ритм и соблюдай его, пока печатаешь. Нажимай на
                    клавиши с одинаковым интервалом.
                  </li>
                  <li>
                    Клавишу SHIFT всегда нажимает мизинец с противоположной
                    стороны от нужной буквы..
                  </li>
                  <li>
                    Пробел отбивай большим пальцем левой или правой руки, как
                    тебе удобнее.
                  </li>
                </ul>
              </p>
              <p>
                Сначала такой метод печати может показаться неудобным. Но не
                останавливайся. Со временем все будет получаться быстро, легко и
                удобно. Чтобы добиться максимального результата, выбирай курс
                слепой печати для твоей раскладки клавиатуры и на нужном языке.
              </p>
            </div>
          </div>
          <img src={require("../../assets/img/training-img3.png")} alt="Keys" />
        </div>
      </TrainingBlock>
      <TrainingBlock>
        <div className="training-block__wrapper">
          <h2>Зачем нужно печатать вслепую?</h2>
          <p>
            Тренировка слепой печати помогает совершенствовать скорость и
            качество набора текста. Это заключается в упражнениях, которые
            заставляют пользователя набирать текст без просмотра клавиатуры.
            Тренировка слепой печати помогает улучшить память, скорость и
            координацию рук.
          </p>
        </div>
      </TrainingBlock>
      <TrainingBlock>
        <div className="training-block__wrapper">
          <h2>Движение пальцев</h2>
          <p>
            Не подглядывай на клавиатуру во время печати. Просто скользи
            пальцами по клавишам, пока не найдешь основную строку.
          </p>
          <p>
            Ограничь движение кистей и пальцев до минимума, только чтобы
            нажимать нужные клавиши. Держи руки и пальцы как можно ближе к
            исходной позиции. Это увеличит скорость набора текста и снизит
            нагрузку на кисти.
          </p>
          <p>
            Следи за безымянными пальцами и мизинцами, так как они часто
            остаются незадействованными.
          </p>
        </div>
      </TrainingBlock>
      <TrainingBlock>
        <div className="training-block__wrapper">
          <h2>Скорость печати</h2>
          <p>
            <ul className="training-block__list">
              <li>
                Не пытайся сразу печатать со скоростью света. Начинай
                ускоряться, только когда все 10 пальцев привыкнут нажимать
                правильные клавиши.
              </li>
              <li>
                Не торопись когда печатаешь, чтобы избежать ошибок. Скорость
                будет возростать постепенно.
              </li>
              <li>Всегда просматривай текст на одно-два слова вперед.</li>
              <li>
                Пройди все уроки на клавиатурном тренажере. И твоя скорость
                станет выше средней скорости печати.
              </li>
            </ul>
          </p>
        </div>
      </TrainingBlock>
      <TrainingBlock>
        <div className="training-block__wrapper">
          <h2>Береги себя</h2>
          <p>
            Сделай паузу, если чувствуешь, что сбиваешься и делаешь много
            ошибок. Небольшой перерыв вернет силы и внимательность.
          </p>
        </div>
      </TrainingBlock>
    </>
  );
}

export default Training;
